# Introdução ao Pandas II

In [75]:
import pandas as pd

path = 'C:\\Users\\Administrador\\Documents\\Modelos Personalizados do Office\\Rafael Nery - Fundamentos de Big Data e Data Analytics com Python\\003 - Arquivos\\'
file = 'bank-full.xlsx'

df = pd.read_excel(path + file, sheet_name= 'Sheet 1 - bank-full')

df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

### Média (mean)

Podemos obter o valor da média simples dos dados utilizando a função pd.mean()

In [76]:
media = df['balance'].mean()

# A função round trata valores, ajustando o número de casas decimais -> round(number, number_of_digits)
round(media,2)

1362.27

### Calculando a média de mais de uma coluna

In [77]:

# Para selecionar mais de uma coluna, você deve passar uma lista contendo os nomes das colunas do Data Frame-> 
# Exemplo -> dataframe[[lista]]
round(df[['balance','duration']].mean(), 0)

balance     1362.0
duration     258.0
dtype: float64

### Soma (sum)

Quando precisamos saber a soma dos valores de uma determinada variável, podemos usar a função pd.sum()

In [78]:
df.balance.sum()

61589682

In [79]:
df.duration.sum()

11671811

In [80]:
# Soma de uma lista de variáveis (coluna)
df[['pdays','duration','balance']].sum()

pdays        1817384
duration    11671811
balance     61589682
dtype: int64

### Unique e Nunique

Unique - nos mostra todos os valores únicos de uma coluna

Nunique - nos mostra a quantidade de elementos únicos em uma coluna

In [81]:
# Comando unique
df.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [82]:
# Comando Nunique
df.job.nunique()

12

### Dados Duplicados

A quantidade de elementos duplicados em uma coluna

In [83]:
df.job.duplicated().sum()

45199

A quantidade de elementos duplicados em uma tabela

In [84]:
df.duplicated().sum()

0

### Identificar os valores duplicados

In [85]:
df.loc[df.duplicated() == True]

Empty DataFrame
Columns: [age, job, marital, education, default, balance, housing, loan, contact, day, month, duration, campaign, pdays, previous, poutcome]
Index: []

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

# Aula 10 - Pandas Pt.2

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

### Remover os Dados Duplicados

Para criar um novo Data Frame sem os dados duplicados, utilizamos a função pd.drop_duplicates().

In [86]:
df_2 = df.drop_duplicates()

### Dados Nulos e Faltantes

Dados faltantes ou nulos podem enviesar as análises, por isso é sempre importante eliminá-los ou substituí-los (de acordo com o contexto de análise).

Uma maneira de saber a quantidade de dados faltantes é utilizar a função pd.isna ou pd.isnull com a função pd.sum().

In [87]:
# Mostrar quais células contém uma informação mula ou não nula.
df.isnull()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45206,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45207,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45208,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45209,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45210,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [88]:
# A quantidade de informações nulas existentes no Data Frame
df.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
dtype: int64

### Excluir informações Nulas ou Faltantes

Para criar um novo Data Frame sem os dados faltantes ou nulos, utilizamos a função pd.dropna()

In [89]:
df_3 = df.dropna()
df_3.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of          age    job  marital  education  default  balance  housing   loan  \
0      False  False    False      False    False    False    False  False
1      False  False    False      False    False    False    False  False
2      False  False    False      False    False    False    False  False
3      False  False    False      False    False    False    False  False
4      False  False    False      False    False    False    False  False
...      ...    ...      ...        ...      ...      ...      ...    ...
45206  False  False    False      False    False    False    False  False
45207  False  False    False      False    False    False    False  False
45208  False  False    False      False    False    False    False  False
45209  False  False    False      False    False    False    False  False
45210  False  False    False      False    False    False    False  False

       contact    day  month  duration  campaign  pdays  previous  poutcome
0        False  False  False     False     False  False     False     False
1        False  False  False     False     False  False     False     False
2        False  False  False     False     False  False     False     False
3        False  False  False     False     False  False     False     False
4        False  False  False     False     False  False     False     False
...        ...    ...    ...       ...       ...    ...       ...       ...
45206    False  False  False     False     False  False     False     False
45207    False  False  False     False     False  False     False     False
45208    False  False  False     False     False  False     False     False
45209    False  False  False     False     False  False     False     False
45210    False  False  False     False     False  False     False     False

[45211 rows x 16 columns]>

### Substiruir dados nulos ou faltantes em Data Frame

Quando for necessário substituir os dados faltantes por um novo valor, podemos usar a função pd.fillna().

In [90]:
df_4 = df.fillna('desconhecido')
df_4.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

## Lista De Exercício 06 – Manipulando Dados Com Pandas (Parte 2)

Exercício 01 – Operações com Pandas

a) Abra o arquivo World Happiness.

b) Qual a média do score_felicidade?

c) Qual a soma do PIB?

d) Qual a soma do freedom e corrupção?

e) Há dados duplicados? Quantos? Verifique quais são eles?

f) Verifique a quantidade de dados faltantes.

g) Crie um dataframe onde os valores faltantes de score_felicidade sejam substituídos por -9999.

h) Quantas e quais são as regiões existentes nos dados?

i) Verifique a frequência dos dados segundo suas regiões. Qual a região com maior quantidade de dados? E a região com a menor quantidade?

In [91]:
import pandas as pd
path = 'C:\\Users\\Administrador\\Documents\\Modelos Personalizados do Office\\Rafael Nery - Fundamentos de Big Data e Data Analytics com Python\\003 - Arquivos\\'
file = 'world_happiness_report_2015.csv'

df = pd.read_csv(path +file)
df.head()

,country,region,happiness rank,happiness score,standard error,economy (GDP per Capita),family,health (Life Expectancy),freedom,trust (Government Corruption),generosity,dystopia residual
0,Switzerland,Western Europe,1,7.587,0.03411,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678,2.51738
1,Iceland,Western Europe,2,7.561,0.04884,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630,2.70201
2,Denmark,Western Europe,3,7.527,0.03328,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139,2.49204
3,Norway,Western Europe,4,7.522,0.03880,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699,2.46531
4,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176

In [92]:
media = df['happiness score'].mean()

print('A média do score_felicidade é: ', round(media,3))

A média do score_felicidade é:  5.424

In [93]:
soma = df['economy (GDP per Capita)'].sum()
print('A soma do PIB é: ', round(soma,3))

A soma do PIB é:  141.372

In [94]:
df[['freedom','trust (Government Corruption)']].sum()

freedom                          71.33320
trust (Government Corruption)    24.59645
dtype: float64

In [95]:
# Quantidade de elementos duplicados
df.duplicated().sum()

6

In [96]:
# Quais são os registros duplicados?
df[df.duplicated() == True]

,country,region,happiness rank,happiness score,standard error,economy (GDP per Capita),family,health (Life Expectancy),freedom,trust (Government Corruption),generosity,dystopia residual
11,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176
12,Finland,Western Europe,6,7.406,0.03140,1.29025,1.31826,0.88911,0.64169,0.41372,0.23351,2.61955
13,Netherlands,Western Europe,7,7.378,0.02799,1.32944,1.28017,0.89284,0.61576,0.31814,0.47610,2.46570
14,Sweden,Western Europe,8,7.364,0.03157,1.33171,1.28907,0.91087,0.65980,0.43844,0.36262,2.37119
34,Oman,Middle East and Northern Africa,22,6.853,0.05335,1.36011,1.08182,0.76276,0.63274,0.32524,0.21542,2.47489
35,Venezuela,Latin America and Caribbean,23,6.810,0.06476,1.04424,1.25596,0.72052,0.42908,0.11069,0.05841,3.19131

In [97]:
# Exibir a quantidade de informações nulas nos campos da tabela

df.isnull().sum()

country                           0
region                            0
happiness rank                    0
happiness score                   8
standard error                    1
economy (GDP per Capita)          0
family                            0
health (Life Expectancy)          0
freedom                           0
trust (Government Corruption)     0
generosity                        0
dystopia residual                14
dtype: int64

#### Crie um dataframe onde os valores faltantes de score_felicidade sejam substituídos por -9999.

In [104]:
# O comando df.loc está selecionando todas as linhas (:) da coluna happiness score e então os nulos são substituídos por -9999

df.loc[:,['happiness score']] == df.loc[:,['happiness score']].fillna(-9999)

df.isnull().sum()

country                           0
region                            0
happiness rank                    0
happiness score                   8
standard error                    1
economy (GDP per Capita)          0
family                            0
health (Life Expectancy)          0
freedom                           0
trust (Government Corruption)     0
generosity                        0
dystopia residual                14
dtype: int64

#### h) Quantas e quais são as regiões existentes nos dados?

In [108]:
# Calcula a quantidade de resgistros duplicados 
df.region.duplicated().sum()

154

In [109]:
# Remove as duplicatas e insere em um novo Data Frame
df_region = df.region.drop_duplicates()

In [113]:
# Calcular a quantidade de regiôes únicas
df_region.count()

10

In [114]:
# Quais são as regiões?
df_region

0                      Western Europe
4                       North America
8           Australia and New Zealand
10    Middle East and Northern Africa
15        Latin America and Caribbean
27                  Southeastern Asia
36         Central and Eastern Europe
43                       Eastern Asia
76                 Sub-Saharan Africa
84                      Southern Asia
Name: region, dtype: object

#### i) Verifique a frequência dos dados segundo suas regiões. Qual a região com maior quantidade de dados? E a região com a menor quantidade?

In [115]:
df.region.value_counts()

Sub-Saharan Africa                 40
Central and Eastern Europe         29
Western Europe                     24
Latin America and Caribbean        23
Middle East and Northern Africa    21
Southeastern Asia                   9
Southern Asia                       7
Eastern Asia                        6
North America                       3
Australia and New Zealand           2
Name: region, dtype: int64